
/*==============================================================*/
/* Table: 书籍                                                    */
/*==============================================================*/
create table 书籍 
(
   条码号                  varchar(50)                    not null,
   书名                   varchar(50)                    not null,
   借阅状态                 varchar(10)                    not null default '可借',
   馆藏地                  varchar(50)                    null,
   索书号                  varchar(20)                    null,
   个人责任者                varchar(50)                    null,
   个人次要责任者              varchar(50)                    null,
   出版社                  varchar(50)                    null,
   出版日期                 date                           null,
   ISBN及定价              float                    null,
   类别                   varchar(50)                    null,
   内容简介                 varchar(max)                  null,
   目录                   varchar(max)                   null,
   中图法分类                varchar(50)                    null,
   学科主题                 varchar(50)                    null,
   载体形态                 varchar(50)                    null,
   光盘服务联系方式             varchar(80)                    null,
   MARC状态               varchar(10)                    null,
   文献类型                 varchar(50)                    null,
   浏览次数                 integer                        not null default 0,
   借阅次数                 integer                        not null default 0,
   借阅日期                 date                           null,
   归还日期                 date                           null,
   constraint PK_书籍 primary key clustered (条码号)
);



/*==============================================================*/
/* Index: 书籍_PK                                                 */
/*==============================================================*/
create unique index 书籍_PK on 书籍 (
条码号 ASC
);

/*==============================================================*/
/* Table: 借书                                                    */
/*==============================================================*/
create table 借书 
(
   条码号                  varchar(50)                    not null,
   证件号                  varchar(50)                    not null,
   constraint PK_借书 primary key clustered (条码号, 证件号)
);

/*==============================================================*/
/* Index: 借书_PK                                                 */
/*==============================================================*/
create unique index 借书_PK on 借书 (
条码号 ASC,
证件号 ASC
);

/*==============================================================*/
/* Index: 借书_FK                                                 */
/*==============================================================*/
create index 借书_FK on 借书 (
条码号 ASC
);

/*==============================================================*/
/* Index: 借书_FK2                                                */
/*==============================================================*/
create index 借书_FK2 on 借书 (
证件号 ASC
);

/*==============================================================*/
/* Table: 学生                                                    */
/*==============================================================*/
create table 学生 
(
   证件号                  varchar(50)                    not null,
   借书证号                 varchar(50)                    null,
   邮箱                   varchar(50)                    null,
   密码                   varchar(20)                    not null default '123456',
   性别                   varchar(10)                    null,
   学院                   varchar(10)                    null,
   专业                   varchar(50)                    null,
   借阅数量                 integer                        null default 0,
   罚款金额                 float                   null,
   是否缴纳                 varchar(10)                    null,
   constraint PK_学生 primary key clustered (证件号)
);



/*==============================================================*/
/* Index: 学生_PK                                                 */
/*==============================================================*/
create unique index 学生_PK on 学生 (
证件号 ASC
);

/*==============================================================*/
/* Table: 登陆者                                                   */
/*==============================================================*/
create table 登陆者 
(
   登录账号                 varchar(50)                    not null,
   证件号                  varchar(50)                    not null,
   密码                   varchar(20)                    not null,
   登录方式                 varchar(20)                    not null,
   constraint PK_登陆者 primary key clustered (登录账号)
);


/*==============================================================*/
/* Index: 登陆者_PK                                                */
/*==============================================================*/
create unique index 登陆者_PK on 登陆者 (
登录账号 ASC
);

/*==============================================================*/
/* Index: 学生登录_FK                                               */
/*==============================================================*/
create index 学生登录_FK on 登陆者 (
证件号 ASC
);

/*==============================================================*/
/* Table: 管理书籍                                                  */
/*==============================================================*/
create table 管理书籍 
(
   条码号                  varchar(50)                    not null,
   登录名                  varchar(50)                    not null,
   constraint PK_管理书籍 primary key clustered (条码号, 登录名)
);

/*==============================================================*/
/* Index: 管理书籍_PK                                               */
/*==============================================================*/
create unique index 管理书籍_PK on 管理书籍 (
条码号 ASC,
登录名 ASC
);

/*==============================================================*/
/* Index: 管理书籍_FK                                               */
/*==============================================================*/
create index 管理书籍_FK on 管理书籍 (
登录名 ASC
);

/*==============================================================*/
/* Index: 管理书籍_FK2                                              */
/*==============================================================*/
create index 管理书籍_FK2 on 管理书籍 (
条码号 ASC
);

/*==============================================================*/
/* Table: 管理员                                                   */
/*==============================================================*/
create table 管理员 
(
   登录名                  varchar(50)                    not null,
   口令                   varchar(20)                    not null,
   工号                   varchar(20)                    not null,
   身份                   varchar(50)                    not null,
   姓名                   varchar(20)                    null,
   性别                   varchar(10)                    null,
   电话                   varchar(20)                    null,
   constraint PK_管理员 primary key clustered (登录名)
);

/*==============================================================*/
/* Index: 管理员_PK                                                */
/*==============================================================*/
create unique index 管理员_PK on 管理员 (
登录名 ASC
);

/*==============================================================*/
/* Table: 管理学生                                                  */
/*==============================================================*/
create table 管理学生 
(
   证件号                  varchar(50)                    not null,
   登录名                  varchar(50)                    not null,
   constraint PK_管理学生 primary key clustered (证件号, 登录名)
);

/*==============================================================*/
/* Index: 管理学生_PK                                               */
/*==============================================================*/
create unique index 管理学生_PK on 管理学生 (
证件号 ASC,
登录名 ASC
);

/*==============================================================*/
/* Index: 管理学生_FK                                               */
/*==============================================================*/
create index 管理学生_FK on 管理学生 (
登录名 ASC
);

/*==============================================================*/
/* Index: 管理学生_FK2                                              */
/*==============================================================*/
create index 管理学生_FK2 on 管理学生 (
证件号 ASC
);

/*==============================================================*/
/* Table: 管理登陆者                                                 */
/*==============================================================*/
create table 管理登陆者 
(
   登录名                  varchar(50)                    not null,
   登录账号                 varchar(50)                    not null,
   constraint PK_管理登陆者 primary key clustered (登录名, 登录账号)
);

/*==============================================================*/
/* Index: 管理登陆者_PK                                              */
/*==============================================================*/
create unique index 管理登陆者_PK on 管理登陆者 (
登录名 ASC,
登录账号 ASC
);

/*==============================================================*/
/* Index: 管理登陆者_FK                                              */
/*==============================================================*/
create index 管理登陆者_FK on 管理登陆者 (
登录账号 ASC
);

/*==============================================================*/
/* Index: 管理登陆者_FK2                                             */
/*==============================================================*/
create index 管理登陆者_FK2 on 管理登陆者 (
登录名 ASC
);

alter table 借书
   add constraint FK_借书_借书_书籍 foreign key (条码号)
      references 书籍 (条码号)


alter table 借书
   add constraint FK_借书_借书_学生 foreign key (证件号)
      references 学生 (证件号)


alter table 登陆者
   add constraint FK_登陆者_学生登录_学生 foreign key (证件号)
      references 学生 (证件号)


alter table 管理书籍
   add constraint FK_管理书籍_管理书籍_书籍 foreign key (条码号)
      references 书籍 (条码号)


alter table 管理书籍
   add constraint FK_管理书籍_管理书籍_管理员 foreign key (登录名)
      references 管理员 (登录名)


alter table 管理学生
   add constraint FK_管理学生_管理学生_学生 foreign key (证件号)
      references 学生 (证件号)


alter table 管理学生
   add constraint FK_管理学生_管理学生_管理员 foreign key (登录名)
      references 管理员 (登录名)


alter table 管理登陆者
   add constraint FK_管理登陆者_管理登陆者_登陆者 foreign key (登录账号)
      references 登陆者 (登录账号)


alter table 管理登陆者
   add constraint FK_管理登陆者_管理登陆者_管理员 foreign key (登录名)
      references 管理员 (登录名)


